[Killed] UnaryOperator
src/transcriptManager.ts:84:61
 // throws an error if the course is already on the transcript
 function addGradeToTranscript(theTranscript: Transcript, course: Course, grade: number): Transcript {
   const { grades } = theTranscript;
-  if (grades.findIndex(entry => entry.course === course) != -1) {
+  if (grades.findIndex(entry => entry.course === course) != +1) {
     throw new Error();
   }
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: student 1 already has a grade in course test course
