[Killed] BlockStatement
src/mocksExample/Calculator.ts:2:52
 export default class Calculator {
-    public add(num1: number, num2: number): number {
-      const result: number = num1 + num2;
-      console.log("The result is: ", result);
-      return result;
-    }
+    public add(num1: number, num2: number): number {}
   }
killedBy: add() should invoke console.log() with the result 2 for inputs 1 and 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/mocksExample/Calculator.ts:3:30
 export default class Calculator {
     public add(num1: number, num2: number): number {
-      const result: number = num1 + num2;
+      const result: number = num1 - num2;
       console.log("The result is: ", result);
       return result;
killedBy: add() should invoke console.log() with the result 2 for inputs 1 and 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0
